{
    "name":"WannaCry",
    "Version":"V0.1.0",
    "Developer":"TKUP",
    "Creator":"KenzluChan-TKUP",
    "StandardUserData": {
        "id": 0,
        "name": "",
        "LV": 0,
        "HP": 100,
        "ATK": 50,
        "DEF": 50,
        "MATK": 0,
        "MDEF": 0,
        "SPD": 95,
        "ML": 0,
        "MCE": 1.0,
        "CRIT": 0.05,
        "CDMG": 0.5,
        "EL": 100,
        "ECE": 1.0,
        "STA": 100,
        "STACE": 1.0,
        "HIT": 0.5,
        "EVA": 0.5,
        "REC": 1.0,
        "ER": {
            "F": 0.0,
            "Wr": 0.0,
            "Wd": 0.0,
            "G": 0.0,
            "L": 0.0,
            "I": 0.0,
            "R": 0.0
        },
        "EB": {
            "F": 0.0,
            "Wr": 0.0,
            "Wd": 0.0,
            "G": 0.0,
            "L": 0.0,
            "I": 0.0,
            "R": 0.0
        }
    },
    "valueDescriptions": {
        "id": "Unique identifier for the user or character.",
        "name": "Name of the user or character.",
        "LV": "Character level, typically affects experience and power.",
        "HP": "Health Points - Represents the character's total health. When it reaches 0, the character is defeated.",
        "ATK": "Attack - Determines physical damage dealt in combat.",
        "DEF": "Defense - Reduces physical damage taken from attacks.",
        "MATK": "Magic Attack - Determines magical damage dealt in combat.",
        "MDEF": "Magic Defense - Reduces magical damage taken from spells.",
        "SPD": "Speed - Affects the order of actions in combat; higher speed means more frequent turns.",
        "ML": "Mana Limit - Maximum mana available for the character.",
        "MCE": "Mana Charge Efficiency - Efficiency at which mana is charged or restored.",
        "CRIT": "Critical Rate - Probability of dealing extra damage with a critical hit.",
        "CDMG": "Critical Damage - Multiplier for extra damage on a critical hit.",
        "EL": "Energy Limit - Maximum amount of energy the character can store.",
        "ECE": "Energy Charge Efficiency - Efficiency at which energy is charged or restored.",
        "STA": "Stamina - Represents the character's ability to perform actions or abilities over time.",
        "STACE": "Stamina Charge Efficiency - Efficiency at which stamina is charged or restored.",
        "HIT": "Hit Rate - Likelihood of successfully landing an attack.",
        "EVA": "Evasion Rate - Likelihood of avoiding an incoming attack.",
        "REC": "Recovery - Rate at which health or mana regenerates.",
        "ER": "Elemental Resistance - Resistance to elemental damage types (F: Fire, Wr: Water, Wd: Wind, G: Grass, L: Lightning, I: Ice, R: Rock). Values reduce damage taken from those elements.",
        "EB": "Elemental Bonus - Additional damage or effect from elemental types (F: Fire, Wr: Water, Wd: Wind, G: Grass, L: Lightning, I: Ice, R: Rock). Values increase damage dealt or effectiveness with those elements."
    }
}